{"title":"Дмитрий Карпов - Gera Volobuev","content":"\n            <h1 id=\"дмитрий-карпов---ux-поведенческое-проектирование\"><strong>Дмитрий Карпов - UX: Поведенческое проектирование</strong></h1>\n\n<p><strong>Лекция 001. Поведенческие сценарии. Ритуальные действия.</strong></p>\n\n<p>Основных поведенческих сценариев четыре:</p>\n\n<ol>\n  <li>Нейтралитет – увидел, использовал объект дизайна, и остался безучастным. При проектировании нужно учитывать почему человек не заинтересовался. Сценарий должен предполагать ответы на вопрос почему не вызвало интерес.</li>\n  <li>Интерес</li>\n  <li>Страсть – нужно как можно быстрее.</li>\n  <li>Негатив. Нужно понимать какие у нее есть мотивы и аргументы против продукта</li>\n</ol>\n\n<p><strong>Лекция 002. Негативное проектирование. Триггеры.</strong></p>\n\n<p>Всегда разрабатывать негативное проектирование – учитывать негативный опыт использования продукта.<br />\nНе спрашивайте почему не нравится - спрашивайте об их жизни, что для них важно.<br />\nСтройте список почему люди отказываются от продолжения использования продукта/не используют фичи, функции.<br />\nЧеловек не хочет учится новому.<br />\nПринцип Парето - 80% старые знания, технологии, 20% новые знания, технологии.</p>\n\n<p><strong>Лекция 003. Психологическое взаимодействие с человеком. Экономия энергозатрат.</strong></p>\n\n<p>Дизайн всегда стремится с снижению энергозатрат.<br />\nЧеловек быстро привыкает к энергосбережению.<br />\nЛюбое действие должно проходить на наиболее близкой амплитуде.<br />\nВсегда должно быть место для примера хорошего поведения. Человек учится на примерах.<br />\nСразу проектируйте пример использования</p>\n\n<p><strong>Лекция 004. CJM-проектирование.</strong></p>\n\n<p>CJM - проектирование потребительских карт, маршрутов.<br />\n1 этап – описание как узнал о потребности, и что её реализуют несколько компаний на рынке. Какие ожидания от продукта.<br />\n2 этап – почему выбор клиента должен быть в нашу сторону. Прогноз действий и ожиданий.<br />\n3 этап – как может произойти первый опыт знакомства.<br />\n4 этап – как клиент действует если не готов будет использовать наш продукт.<br />\n5 этап - SWOT анализ своего и конкурентного продуктов. Сильные, слабые стороны. Возможности и опасности в перспективе<br />\n6 этап - Как человек поделится о своем положительном опыте. Какими соц-сетями воспользуется.</p>\n\n<p><strong>Лекция 005. Логика двигателей роста интерактивной системы.</strong></p>\n\n<p>Факторы динамического UX</p>\n<ol>\n  <li>Возвращаемость – проработать как система общается с человеком. Есть 5 типов общения\n    <ol>\n      <li>Наставник – система ждет вопросов.</li>\n      <li>Друг – близкие отношения, может обращаться на «ты», по имени.</li>\n      <li>Заботливый\\мать – много всплывающих окон, тюторов и тп. Антипод наставника.</li>\n      <li>Партнер – только бизнес.</li>\n      <li>Торговец – много предложений дополнительных сервисов, допродаж</li>\n    </ol>\n  </li>\n  <li>Виральность</li>\n  <li>Маржинальность</li>\n</ol>\n\n    "}