{"title":"Дмитрий Карпов - Gera Volobuev","content":"\n            <h2 id=\"дмитрий-карпов---дизайн-своей-карьеры\">Дмитрий Карпов - Дизайн своей карьеры</h2>\n\n<p><a href=\"https://bangbangeducation.ru/course/career-design\" title=\"https://bangbangeducation.ru/course/career-design\">https://bangbangeducation.ru/course/career-design</a></p>\n\n<p>Дмитрий Карпов мужик колоритный. Видел пару его выступлений на просмотре. За следующую неделю посмотрю несколько его курсов на ресурсе. Ресурс тоже понравился, как визуально так и в части контента. Чувствуется что не «толкают», а культурно торгуют знаниями. Есть бесплатные курсы.</p>\n\n<p>По итогу курса убедился что дизайн, это про мультидисциплинарность. Пригодится все - от истории искусства викторианской эпохи до основ гештальт-психологии и социологии.</p>\n\n<p><strong>Лекция 001 - Четыре основных мотива получения профессии.</strong></p>\n\n<p>Карьера - это про самореализацию<br />\nОпределить в чем я хорош уже сейчас, и куда я хочу попасть через 5 лет.<br />\nМесто работы должно быть и местом постоянного обучения.<br />\nВозможность работать в области рынка либо с определённым типом клиентов.</p>\n\n<p><strong>Лекция 002 - Как выглядит путь разного вида дизайнеров.</strong></p>\n\n<p>Чем бы я хотел заниматься?<br />\nКарта профессии:</p>\n<ol>\n  <li>Освоение технологий - какие нужны именно сейчас и для будущего развития в профессии.</li>\n  <li>Область мышления. Осваивание креативных методик.</li>\n</ol>\n\n<p><strong>Лекция 003 - Компетенции, которые помогают на рынке.</strong></p>\n\n<p>Интеллектуальное мастерство - знания в разных областях (психология, социология, культурология, история медиа и искусства)<br />\nТехнологии. Карьера невозможно без знания основы тех-знаний области.<br />\nВажно уметь разделять при изучении технологии на сегменты - важные и нужные сейчас и в будущем.<br />\nВизуальный опыт - владение инструментов, хорошее знание стилей, шрифтов, визуальная культура.</p>\n\n<p><strong>Лекция 004 - Работа с портфолио как часть планирования карьеры дизайнера.</strong></p>\n\n<p>Портфолио хорошего дизайнера это буквально четыре страницы.<br />\nНе кладите в портфолио работы которые вас уже не характеризуют. <br />\nВ портфолио могут быть учебные работы. Без клиентов.<br />\nВ портфолио должны быть:</p>\n<ol>\n  <li>Крупные бренды-доверители для известных брендов. Они должны быть всегда в начале портфолио, должны быть заметны</li>\n  <li>Проект который показывает то что ты делаешь очень хорошо.</li>\n  <li>Проект технического мастерства. Сам подбирал шрифты, графику и т.п.</li>\n  <li>Проект «завтра». То как ты хотел бы работать в будущем. Экспериментальный проект.</li>\n</ol>\n\n<p><strong>Лекция 005 - Суперпрофессионалы, на которых ты ориентируешься.</strong></p>\n\n<p>В процессе развития должен понимать 10 лучших в профессии. Следить за их работами.<br />\nНаписать простое резюме. Постараться рассказать в 5 предложений, честно, почему я хороший дизайнер.</p>\n\n    "}