{"title":"Ян Чихольд \"Новая типографика\" - Gera Volobuev","content":"\n            <h2 id=\"ян-чихольд-новая-типографика\">Ян Чихольд «Новая типографика»</h2>\n\n<p>Первая книга по которой делаю конспект. Саму книгу купил случайно, в магазине, уж очень дешевая была (хотя не БУ) по сравнению даже с «Лабиринтом». Хотя издательство нихуево дорогие книги выпускает (например «Книга про буквы» Юрия Гордона - 4849р!).</p>\n\n<p>Вообщем, книга понравилась. Довольно «обзорная». Я по незнанке думал что будет много посвящено работе с текстом. Шрифты, выключки, интерлиньяж и тд.\nНо в книге объясняется вся работа дизайнера - и подбор шрифтов, и компоновка блоков текста, модульные сетки, фотографии, работа над логотипами.</p>\n\n<p>Много примеров. Автор сразу показывает и обосновывает почему это гут, а это шайсе:</p>\n\n<p><em>При чтении взгляд движется. Текст направляет взгляд читателя от одного слова к другому, от одного блока к другому. Поэтому необходимо логичное членение текста с помощью разных примеров, плотности, расположение, цвета и т.д.</em></p>\n\n<p>Часто автор довольно категоричен в своих высказываниях (хотя я слышал что позднее Чихольд пересмотрел ряд своих принципов).<br />\nЭто касается как практических правил:</p>\n\n<p><em>Без сомнения, для плаката подходит только самая четкая форма шрифта – гротеск</em></p>\n\n<p>Так и более общих принципов:</p>\n\n<p><em>Содержание напечатанного текста должно быть выражено ясно и точно. Его форма должна создаваться его функцией, как в творениях техники и природы</em></p>\n\n<p>Параллельно я читал Маршала Маклюэнна «Понимание Медиа». На ум приходит Дэвид Карсон и его работы (который по образованию социолог и часто упоминал влияние Маклюэнна). Было бы интересно узнать мнение Чихольда по поводу его работ, и что например «средство коммуникации и есть сообщение».</p>\n\n<p>Еще Ян очень любит асимметрию, и по любому случаю не забывает нахваливать:</p>\n\n<p><em>Асимметричные формы боле логичны. Кроме того, их визуальное воздействие гораздо сильнее, чем у симметричных форм.</em></p>\n\n<p><em>Плакат должен быть максимально эффектным и понятным. Главная ошибка почти всех наборных плакатов – привычная симметричная композиция. Ассиметричное построение плаката лучше соответствует задаче, потому что строки группируются самым подходящим для чтения образом.</em></p>\n\n<p>Некоторые цитаты надо запомнить, чтоб пулятся ими перед заказчиками и в барах перед студентками:</p>\n\n<p><em>Человек, который не довольствуется четкой конструкцией предмета и начинает его украшать, тем самым оказывается во власти примитивных представлений (что, в сущности, свидетельствует о том, что он боится неприкрашенного предмета).</em></p>\n\n<p>Еще цитат:</p>\n\n<p><em>Поэтому форма печатной продукции должна быть приведена в соответствие с требованиями сегодняшней жизни. Как правило, сегодня мы не читаем спокойно строчку за строчкой, а стараемся сперва пробежать весь текст целиком, а потом, если находим что-то интересное, то изучаем это обстоятельнее.</em></p>\n\n<p><em>Природа и техника учат нас тому, что форма не существует сама по себе, а возникает из функции (цель, назначения), используемого материала (природного или технического) и конструкции (природной и технической).</em></p>\n\n<p><em>Если мы хотим «оказать уважение» великим достижениям прежних времен, то мы должны создать наши собственные произведения, отражающие современность. Они станут «классикой», только если не будут подражать древним образцам.</em></p>\n\n<p><em>Предельная ясность нужна, потому что современный человек перегружен невероятным количеством разнообразной печатной продукции. Поэтому требуется высочайшая экономия выразительных средств.</em></p>\n\n<p><em>Очень важно, чтобы типограф знал, как читают и как должны читать его издания</em></p>\n\n<p><em>Большую часть печатной продукции мы читаем последовательно: сначала заголовок (он далеко не всегда стоит в начале), а потом, если мы вообще продолжаем читать, остальные блоки текста, в зависимости от важности. Поэтому вполне можно начать не с текста, расположенного слева наверху, а с какого-нибудь другого места.</em></p>\n\n<p><em>Высшее требование - целесообразность. Но не надо понимать под этим форму, лишенную всего, что ей сопутствовало раньше.</em></p>\n\n<p><em>Своеобразие одной формы проявляется наиболее ярко, когда она констатирует с противоположной формой.</em></p>\n\n<p><em>Белые участки бумаги – такие же равноценные элементы композиции, как черные шрифты и плашки.</em></p>\n\n<p><em>Новая типографика применяет цвет функционально, то есть использует воздействие, свойственное тому или иному цвету, для усиления или ослабления композиционной группы, фотографии и т.д. Например, свойство белого цвета – отражать свет, сиять. Красный выступает вперед относительно других цветов, он всегда кажется ближе, чем любой другой цвет. Черный, наоборот, самый глубокий цвет, он отступает дальше всех на задний план. Из других цветов желтый, например, родственен красному, а синий – черному.</em></p>\n\n<p><em>Форма логотипа должна быть проста и самобытна, он должен легко запоминается, то есть быть узнаваемым и заметным.</em></p>\n\n<p><em>Удачный товарный знак можно сделать и типографскими средствами, причем он часто бывает даже более выразительным, чем нарисованный.</em></p>\n\n<p><em>Реклама – результат разнообразия, нарушения прав, неожиданности. Поэтому совершенно нормально, что ограничение оформительский средств для рекламы неприемлемо.</em></p>\n\n<p><em>Если реклама исключительно текстовая, нужно найти новаторскую типографскую форму.</em></p>\n\n<p><em>Особенность рекламной продукции заключается в том, что нужно добиться наибольшего эффекта с помощью любых сильных контрастов. Нужно стараться использовать толко основные элементы: шрифт, фотографии и т.д. Лишь когда они недостаточно контрастируют друг с другом, можно применить второстепенные формы: полосы, линии, точки.</em></p>\n\n<p><em>Фотография – знак, передающий информацию, как и буква. Чем быстрее и проще знак может передать смысл сообщения, тем он лучше.</em></p>\n\n<p><em>Широкие полосы, линии, точки и т.д. Должны быть функционально необходимы.</em></p>\n\n<p><em>Полоски и т.д. только тогда необходимы и важны, когда создают и подчеркивают нужный контраст.</em></p>\n\n<p><em>Очень действенный прием для текстового плаката – пустое пространство. Оно бросается в глаза.</em></p>\n\n<p><em>Если используется круглая или другая «второстепенная» форма, то она должна быть не чисто декоративной, а функциональной, то есть на что-то указывать или то-то подчеркивать. Эффект должен достигаться другими средствами – с помощью больших букв, цифр и своеобразной композиции.</em></p>\n\n<p>**</p>\n\n    "}