{"title":"Дэвид Аллен - Gera Volobuev","content":"\n            <h2 id=\"девид-аллен---getting-things-done\">Девид Аллен - Getting Things Done</h2>\n\n<p><img src=\"https://upload.wikimedia.org/wikipedia/ru/4/4a/Russiangtddrawing1dc1.jpg\" alt=\"\" /></p>\n\n<p>Про методику GTD я услышал еще лет 5 назад. Прочитал в блоге Лео Бабуты про технику Zen to Done, которую он как раз создал переработав GTD под себя. Еще и книжки продает по ней. Еврей. В общем я пользовался системой GTD еще даже не прочитав о ней - записывал список дел на день, цели на неделю и месяц. Каждый день пользовался небольшими стикерами куда и записывал все что необходимо сделать за день. Потом мне это надоело и я решил запилить себе небольшое приложение. И шекелей сэкономил. Еврей.</p>\n\n<p>Теперь по книге. Это пожалуй самая “инструментальная”, полезная, в смысле техник и конкретных действий книга которую я читал за все время сколько я читаю книги.\nПометки и закладки делал чуть ли не на каждой странице.\nЕсли вкратце суть метода такая:</p>\n\n<p>1. Собираем все, что привлекло наше внимание. Выбросить все из головы.</p>\n\n<p>2. Обрабатываем, проясняем что означает каждая деталь и что с этим делать.</p>\n\n<p>3. Организуем результат в виде различных вариантов.</p>\n\n<p>4. Обзор. Выбираем один.</p>\n\n<p>5. Выполнение.</p>\n\n<p>Основная идея - ничего не держите в голове. Тупой карандаш лучше острой памяти.</p>\n\n<p><em>В сознании - все в настоящем времени. Это означает, что как только вы скажете себе, что нужно что-то сделать, и эта информация останется у вас лишь в краткосрочной памяти, эта часть вашего сознания будет думать, что выполнением данной задачи нужно заниматься постоянно… Если вы храните задачу только в своей голове, то эта задача станет нарушенной договоренностью, если вы не займетесь ею прямо сейчас.</em></p>\n\n<p><em>Инструментарий для сбора и хранения информации, целей и проектов должен быть максимально удобен и прост.</em></p>\n\n<p>Все цели, желания, мысли, почта, бумага, визитки, планы отмщения и захвата мира - помещается в главную папку «Входящие»</p>\n\n<p><em>Нужно собрать в одном месте все дела, которые вы считаете незавершенными: личные или профессиональные, больше или маленькие, срочные или важные – все, что должно быть изменено и по поводу чего вы ощущаете любую степень внутренного обязательства это изменить.</em></p>\n\n<p><em>Всегда начинайте с того, что лежит первым<br />\nБеритесь за раз только за один вопрос<br />\nНикогда не возвращайте обратно в корзину «Входящие»</em></p>\n\n<p>Далее мы обрабатываем входящее - сортируем.</p>\n\n<p><em>Входящие» – это инструмент обработки информации а не её хранения</em></p>\n\n<p>Требует ли это действий?<br />\nЕсли ответ нет, возможны три варианта действий с информацией:</p>\n<ol>\n  <li>Удалить</li>\n  <li>Отложить</li>\n  <li>Сохранить как справочную</li>\n</ol>\n\n<p>Далее, если это требует действий, мы определяем следующий шаг:</p>\n\n<p><em>Следущий шаг должен быть конкретным физическим действием.<br />\nНужно опередить, какое физическое действие должно произойти, чтобы стимулировать вас принять решение.</em></p>\n\n<p>Когда вы решили каким будет следующий шаг, есть три варианта действий:</p>\n<ol>\n  <li>Сделать (если это займет меньше двух минут»</li>\n  <li>Делегировать (если есть люди которые справиться лучше вас)</li>\n  <li>Отложить</li>\n</ol>\n\n<p>Правило двух минут это вообще одна из главных техник книги:</p>\n\n<p><em>Правило двух минут - если следующее действие займет меньше двух минут, выполните его сразу, как только приняли решение.</em></p>\n\n<p>Очень важный момент - проекты и как их определять:</p>\n\n<p><em>Под проектом я понимаю любой желаемый результат, которого можно добиться течении года, требующий более одного действия… Если одно действие не обеспечит решение задачи, необходимо установить напоминание о том, что вам нужно сделать что-то еще.</em></p>\n\n<p>Для проектов которые хотели бы однажды реализовать так же есть отдельная папка:</p>\n\n<p><em>Что бы вы хотели сделать однажды, будь у вас время, деньги и желание? Запишите это в список «когда нибудь». Если при размышлении вы поймете, что не сможете взяться за какой-то из запланированных проектов в ближайшие несколько месяцев, помещайте его в этот список.</em></p>\n\n<p>Также есть несколько моделей планирования и принятия решений.\nМодель принятия решения на основе четырех критериев:</p>\n<ol>\n  <li>Контекст. Чем вы можете заняться там, где находитесь. Если вы не можете совершить действие, потому что находитесь не в том месте или не располагаете нужными инструментами, то об этом не стоит и беспокоится.</li>\n  <li>Время</li>\n  <li>Энергия</li>\n  <li>Приоритет</li>\n</ol>\n\n<p>Модель естественного планирования:</p>\n\n<ol>\n  <li>Определить цель и результат. Намерение это цель, принципы это границы, в рамках которых будет развиваться ваш план.</li>\n  <li>Визуализировать результат. В то время как цель это ответ на вопрос «зачем?», визуализация это ответ на вопрос «что?» - иными словами, каким должен быть мир вокруг вас, его образы, звуки, ощущения, чтобы это наилучшим образом соответствовало вашей цели.</li>\n  <li>Провести мозговой штурм. Генерация идей без внутренних и внешних рамок. Не критиковать на этом этапе.</li>\n  <li>Осуществить организацию. Когда сгенерировано достаточное колл-во идей и деталей, вам ничего не остается, как начать их организовывать</li>\n  <li>Определить следующие конкретные действия.</li>\n</ol>\n\n<p>Также очень важно постоянно освежать проекты и просматривать списки. Делать обзор всей системы:</p>\n\n<p><em>Еженедельный обзор – это все, что вам необходимо сделать, чтобы освободить голову и сфокусировать свою деятельность на следующие пару недель. Он включает все этапы управления рабочим процессом: сбор, обработку, организацию и обзор всех ваших обязательств и намерений, чтобы вы могли честно сказать «Я точно знаю весь перечень задач, которые сейчас не делаю, но которыми мог бы занятая, если бы счел это нужным.</em></p>\n\n<p>**</p>\n\n<p>Короче говоря, книга полезная. Свои деньги полностью окупает (хотя мне книгу подарили).</p>\n\n<p>Каждый день записываю любые мысли и задачи в «Входящие». Все проекты и дела на год перенес в систему. За месяц сделал больше чем за прошедшие три месяца. Главный плюс - реально меньше проёбываюсь. Начинаешь контролить свое время.</p>\n\n<p>Использую приложение Todoist. Очень удобное, полностью поддерживает методологию. Синхронится со всем iOS девайсами. В будущем планирую прикупить также Things.</p>\n\n<p>Ну и несколько цитат в заключении.</p>\n\n<p><em>Проблема заключается не в отсутствии творческого начала, а в том чтобы устранить барьеры для естественного потока творческой энергии.</em></p>\n\n<p><em>За долгие годы практики я понял, что важнее всего справится с тем, о чем вы больше всего думаете в настоящий момент. То, что вы сами не хотите придавать этому большого значения, не играет никакой роли. Вы уже об этом думаете, и на то есть причина… Просто беритесь за то, что волнует вас сейчас.</em></p>\n\n<p><em>Чувство тревоги и вины возникает не из-за избытка работы. Оно появляется автоматически, когда вы нарушаете договоренности с самим собой…</em></p>\n\n<p><em>Существует три варианта действий, чтобы устранить негативные последствия:</em></p>\n<ol>\n  <li>Не заключать договоренности</li>\n  <li>Выполнить договоренность</li>\n  <li>Пересмотреть договоренность</li>\n</ol>\n\n<p><em>Одна из причин, по которой вы можете сбиться с пути, заключается в том, что постепенно списки действий вновь превращаются в списки задач или подпроектов, вместо того чтобы содержать отдельные, вполне конкретные шаги.</em></p>\n\n<p><em>Финальные советы:</em></p>\n<ol>\n  <li>Создайте свою персональную систему организации дел</li>\n  <li>Наведите порядок на своем рабочем столе</li>\n  <li>Организуйте корзины «Входящие»</li>\n  <li>Создайте работающую и легкодоступную персональную систему хранения справочных материалов на работе и дома</li>\n  <li>Выберите хороший инструмент для создания списков и управления ими, которым вам будет приятно пользоваться</li>\n  <li>Сделайте любые изменения, необходимые для улучшения рабочей среды. Повесьте картины, купите канцелярские принадлежности, выбросьте старые вещи – преобразите рабочее место. Всячески поддержите новый старт.</li>\n  <li>Выделите время, когда вы могли бы полностью разобрать отдельный участок офиса, либо угол дома. Соберите всю систему и проработайте её.</li>\n  <li>Поделитесь навыками из этой книгой с кем нибудь еще.</li>\n  <li>Вернитесь к книге через 3-6 месяцев</li>\n  <li>Поддерживайте контакты с людьми, которые передают и развивают описанные навыки и стандарты.</li>\n</ol>\n\n    "}