{"title":"Дмитрий Карпов - Gera Volobuev","content":"\n            <h2 id=\"дмитрий-карпов---курс-про_движение\">Дмитрий Карпов - Курс Про_движение</h2>\n\n<p>Этот курс схож с предидущим в части работы с портфолио и ведением соц-сетей и блогов.<br />\nБольше инфы про сам формат продвижения, развитие стратегии ведения и формат информационных материалов для блога и соц-сетей. Вкратце про работу с клиентами и их поиск.</p>\n\n<p><strong>Урок 001 Портфолио</strong></p>\n\n<p>8-12 проектов для портфолио. <br />\n5 работ - лучшие<br />\n3-4 работы показывающие развитие.<br />\nГлавные проекты - показывают доверие клиентов. <br />\nОдин проект - вызывает информационный интерес. Self-promo проект.<br />\nРассказывайте про процесс.<br />\nВ каких проектах вы достигли хорошего социального капитала.</p>\n\n<p><strong>Урок 002 Другая активность</strong></p>\n\n<p>20% пишем о завершенных проектах, не удавшихся, плохих проектах.<br />\n20% пишем о том что изучаю, кем хочу стать завтра.<br />\n20% пишем о событиях вокруг. Критика.<br />\n20% рассказ о инструментах, знаниях.<br />\n20% вирусные посты. Небольшие творческие, креативные шутки о том что происходит вокруг.</p>\n\n<p><strong>Урок 003 Критические обсуждения</strong></p>\n\n<p>Промо-порки - «Мне представляется, что здесь стоит сделать по другому. Будет работать лучше.»<br />\nЭмоционально, корректно, не грубо. Профессионально.<br />\nВсегда предлагайте решение.</p>\n\n<p><strong>Урок 004 Стратегия</strong></p>\n\n<p>Цели нужно формулировать на небольшие отрезки времени.<br />\n3-4 месяца.<br />\nО чем бы я хотел рассказывать. О чем нужно рассказывать. Каких целей нужно добиться. Как я буду идти к этому неделя за неделей.<br />\nЗадача расширение аудитории не является доминантным.<br />\n1 месяц - принимаем решение писать о 3-4 тематиках.<br />\nНикогда не лгать.</p>\n\n<p><strong>Урок 005 Детали</strong></p>\n\n<p>Понять какие каналы информации просматривают люди принимающие решение о сотрудничестве с другими дизайнерами.<br />\nПровести анализ текущих клиентов. Возможно черен них есть выход на конкурентов либо «соседей» по бизнесу.<br />\nСвязываться с потенциальными заказчиками напрямую.<br />\n«Мне очень нравится ваш продукт, я знаю как сделать его еще лучше.»<br />\nНе всегда стоит «спускаться» на язык клиента.</p>\n\n<p><strong>Урок 006 Моменты</strong></p>\n\n<p>Излишняя самокритичность.<br />\nДизайнеру важно быть сдержанным в своих оценках и высказываниях.<br />\nСтоит быть намеренно самокритичным и корректными. Не высказываться в плоскости не уверенности либо самоуверенности («мне показалось что…», «очевидно что…»).<br />\nРепутация исполнительного человека важнее репутации гениального дизайнера.</p>\n\n    "}